grevaillot/svd_tools/headers/STM32H7x7_CM7/gpioi.h
#pragma once 

/* --- GPIOI: GPIO -------------------------------------------------- */

/** @defgroup gpioi_registers GPIO Register
@{*/

/** GPIOI_GPIO_MODER GPIO port mode register **/
#define GPIOI_GPIO_MODER			MMIO32(GPIOI_BASE + 0x00)
/** GPIOI_GPIO_OTYPER GPIO port output type register **/
#define GPIOI_GPIO_OTYPER			MMIO32(GPIOI_BASE + 0x04)
/** GPIOI_GPIO_OSPEEDR GPIO port output speed register **/
#define GPIOI_GPIO_OSPEEDR			MMIO32(GPIOI_BASE + 0x08)
/** GPIOI_GPIO_PUPDR GPIO port pull-up/pull-down register **/
#define GPIOI_GPIO_PUPDR			MMIO32(GPIOI_BASE + 0x0c)
/** GPIOI_GPIO_IDR GPIO port input data register **/
#define GPIOI_GPIO_IDR			MMIO32(GPIOI_BASE + 0x10)
/** GPIOI_GPIO_ODR GPIO port output data register **/
#define GPIOI_GPIO_ODR			MMIO32(GPIOI_BASE + 0x14)
/** GPIOI_GPIO_BSRR GPIO port bit set/reset register **/
#define GPIOI_GPIO_BSRR			MMIO32(GPIOI_BASE + 0x18)
/** GPIOI_GPIO_LCKR This register is used to lock the configuration of the port bits when a correct write sequence is applied to bit 16 (LCKK). The value of bits [15:0] is used to lock the configuration of the GPIO. During the write sequence, the value of LCKR[15:0] must not change. When the LOCK sequence has been applied on a port bit, the value of this port bit can no longer be modified until the next MCU reset or peripheral reset.A specific write sequence is used to write to the GPIOx_LCKR register. Only word access (32-bit long) is allowed during this locking sequence.Each lock bit freezes a specific configuration register (control and alternate function registers). **/
#define GPIOI_GPIO_LCKR			MMIO32(GPIOI_BASE + 0x1c)
/** GPIOI_GPIO_AFRL GPIO alternate function low register **/
#define GPIOI_GPIO_AFRL			MMIO32(GPIOI_BASE + 0x20)
/** GPIOI_GPIO_AFRH GPIO alternate function high register **/
#define GPIOI_GPIO_AFRH			MMIO32(GPIOI_BASE + 0x24)

/**@}*/


/** @defgroup gpioi_gpio_moder GPIOMODER GPIO port mode register
@{*/


#define GPIOI_GPIO_MODER_MODER15_SHIFT		30
#define GPIOI_GPIO_MODER_MODER15_MASK		0x03
/** @defgroup gpioi_gpio_moder_moder15 MODER15 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O mode.
@{*/
/**@}*/


#define GPIOI_GPIO_MODER_MODER14_SHIFT		28
#define GPIOI_GPIO_MODER_MODER14_MASK		0x03
/** @defgroup gpioi_gpio_moder_moder14 MODER14 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O mode.
@{*/
/**@}*/


#define GPIOI_GPIO_MODER_MODER13_SHIFT		26
#define GPIOI_GPIO_MODER_MODER13_MASK		0x03
/** @defgroup gpioi_gpio_moder_moder13 MODER13 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O mode.
@{*/
/**@}*/


#define GPIOI_GPIO_MODER_MODER12_SHIFT		24
#define GPIOI_GPIO_MODER_MODER12_MASK		0x03
/** @defgroup gpioi_gpio_moder_moder12 MODER12 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O mode.
@{*/
/**@}*/


#define GPIOI_GPIO_MODER_MODER11_SHIFT		22
#define GPIOI_GPIO_MODER_MODER11_MASK		0x03
/** @defgroup gpioi_gpio_moder_moder11 MODER11 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O mode.
@{*/
/**@}*/


#define GPIOI_GPIO_MODER_MODER10_SHIFT		20
#define GPIOI_GPIO_MODER_MODER10_MASK		0x03
/** @defgroup gpioi_gpio_moder_moder10 MODER10 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O mode.
@{*/
/**@}*/


#define GPIOI_GPIO_MODER_MODER9_SHIFT		18
#define GPIOI_GPIO_MODER_MODER9_MASK		0x03
/** @defgroup gpioi_gpio_moder_moder9 MODER9 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O mode.
@{*/
/**@}*/


#define GPIOI_GPIO_MODER_MODER8_SHIFT		16
#define GPIOI_GPIO_MODER_MODER8_MASK		0x03
/** @defgroup gpioi_gpio_moder_moder8 MODER8 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O mode.
@{*/
/**@}*/


#define GPIOI_GPIO_MODER_MODER7_SHIFT		14
#define GPIOI_GPIO_MODER_MODER7_MASK		0x03
/** @defgroup gpioi_gpio_moder_moder7 MODER7 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O mode.
@{*/
/**@}*/


#define GPIOI_GPIO_MODER_MODER6_SHIFT		12
#define GPIOI_GPIO_MODER_MODER6_MASK		0x03
/** @defgroup gpioi_gpio_moder_moder6 MODER6 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O mode.
@{*/
/**@}*/


#define GPIOI_GPIO_MODER_MODER5_SHIFT		10
#define GPIOI_GPIO_MODER_MODER5_MASK		0x03
/** @defgroup gpioi_gpio_moder_moder5 MODER5 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O mode.
@{*/
/**@}*/


#define GPIOI_GPIO_MODER_MODER4_SHIFT		8
#define GPIOI_GPIO_MODER_MODER4_MASK		0x03
/** @defgroup gpioi_gpio_moder_moder4 MODER4 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O mode.
@{*/
/**@}*/


#define GPIOI_GPIO_MODER_MODER3_SHIFT		6
#define GPIOI_GPIO_MODER_MODER3_MASK		0x03
/** @defgroup gpioi_gpio_moder_moder3 MODER3 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O mode.
@{*/
/**@}*/


#define GPIOI_GPIO_MODER_MODER2_SHIFT		4
#define GPIOI_GPIO_MODER_MODER2_MASK		0x03
/** @defgroup gpioi_gpio_moder_moder2 MODER2 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O mode.
@{*/
/**@}*/


#define GPIOI_GPIO_MODER_MODER1_SHIFT		2
#define GPIOI_GPIO_MODER_MODER1_MASK		0x03
/** @defgroup gpioi_gpio_moder_moder1 MODER1 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O mode.
@{*/
/**@}*/


#define GPIOI_GPIO_MODER_MODER0_SHIFT		0
#define GPIOI_GPIO_MODER_MODER0_MASK		0x03
/** @defgroup gpioi_gpio_moder_moder0 MODER0 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O mode.
@{*/
/**@}*/


/**@}*/

/** @defgroup gpioi_gpio_otyper GPIOOTYPER GPIO port output type register
@{*/

/** GPIOI_GPIO_OTYPER_OT15 Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O output type. **/
#define GPIOI_GPIO_OTYPER_OT15		(1 << 15)
/** GPIOI_GPIO_OTYPER_OT14 Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O output type. **/
#define GPIOI_GPIO_OTYPER_OT14		(1 << 14)
/** GPIOI_GPIO_OTYPER_OT13 Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O output type. **/
#define GPIOI_GPIO_OTYPER_OT13		(1 << 13)
/** GPIOI_GPIO_OTYPER_OT12 Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O output type. **/
#define GPIOI_GPIO_OTYPER_OT12		(1 << 12)
/** GPIOI_GPIO_OTYPER_OT11 Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O output type. **/
#define GPIOI_GPIO_OTYPER_OT11		(1 << 11)
/** GPIOI_GPIO_OTYPER_OT10 Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O output type. **/
#define GPIOI_GPIO_OTYPER_OT10		(1 << 10)
/** GPIOI_GPIO_OTYPER_OT9 Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O output type. **/
#define GPIOI_GPIO_OTYPER_OT9		(1 << 9)
/** GPIOI_GPIO_OTYPER_OT8 Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O output type. **/
#define GPIOI_GPIO_OTYPER_OT8		(1 << 8)
/** GPIOI_GPIO_OTYPER_OT7 Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O output type. **/
#define GPIOI_GPIO_OTYPER_OT7		(1 << 7)
/** GPIOI_GPIO_OTYPER_OT6 Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O output type. **/
#define GPIOI_GPIO_OTYPER_OT6		(1 << 6)
/** GPIOI_GPIO_OTYPER_OT5 Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O output type. **/
#define GPIOI_GPIO_OTYPER_OT5		(1 << 5)
/** GPIOI_GPIO_OTYPER_OT4 Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O output type. **/
#define GPIOI_GPIO_OTYPER_OT4		(1 << 4)
/** GPIOI_GPIO_OTYPER_OT3 Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O output type. **/
#define GPIOI_GPIO_OTYPER_OT3		(1 << 3)
/** GPIOI_GPIO_OTYPER_OT2 Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O output type. **/
#define GPIOI_GPIO_OTYPER_OT2		(1 << 2)
/** GPIOI_GPIO_OTYPER_OT1 Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O output type. **/
#define GPIOI_GPIO_OTYPER_OT1		(1 << 1)
/** GPIOI_GPIO_OTYPER_OT0 Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O output type. **/
#define GPIOI_GPIO_OTYPER_OT0		(1 << 0)

/**@}*/

/** @defgroup gpioi_gpio_ospeedr GPIOOSPEEDR GPIO port output speed register
@{*/


#define GPIOI_GPIO_OSPEEDR_OSPEED15_SHIFT		30
#define GPIOI_GPIO_OSPEEDR_OSPEED15_MASK		0x03
/** @defgroup gpioi_gpio_ospeedr_ospeed15 OSPEED15 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O output speed. Note: Refer to the device datasheet for the frequency specifications and the power supply and load conditions for each speed.
@{*/
/**@}*/


#define GPIOI_GPIO_OSPEEDR_OSPEED14_SHIFT		28
#define GPIOI_GPIO_OSPEEDR_OSPEED14_MASK		0x03
/** @defgroup gpioi_gpio_ospeedr_ospeed14 OSPEED14 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O output speed. Note: Refer to the device datasheet for the frequency specifications and the power supply and load conditions for each speed.
@{*/
/**@}*/


#define GPIOI_GPIO_OSPEEDR_OSPEED13_SHIFT		26
#define GPIOI_GPIO_OSPEEDR_OSPEED13_MASK		0x03
/** @defgroup gpioi_gpio_ospeedr_ospeed13 OSPEED13 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O output speed. Note: Refer to the device datasheet for the frequency specifications and the power supply and load conditions for each speed.
@{*/
/**@}*/


#define GPIOI_GPIO_OSPEEDR_OSPEED12_SHIFT		24
#define GPIOI_GPIO_OSPEEDR_OSPEED12_MASK		0x03
/** @defgroup gpioi_gpio_ospeedr_ospeed12 OSPEED12 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O output speed. Note: Refer to the device datasheet for the frequency specifications and the power supply and load conditions for each speed.
@{*/
/**@}*/


#define GPIOI_GPIO_OSPEEDR_OSPEED11_SHIFT		22
#define GPIOI_GPIO_OSPEEDR_OSPEED11_MASK		0x03
/** @defgroup gpioi_gpio_ospeedr_ospeed11 OSPEED11 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O output speed. Note: Refer to the device datasheet for the frequency specifications and the power supply and load conditions for each speed.
@{*/
/**@}*/


#define GPIOI_GPIO_OSPEEDR_OSPEED10_SHIFT		20
#define GPIOI_GPIO_OSPEEDR_OSPEED10_MASK		0x03
/** @defgroup gpioi_gpio_ospeedr_ospeed10 OSPEED10 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O output speed. Note: Refer to the device datasheet for the frequency specifications and the power supply and load conditions for each speed.
@{*/
/**@}*/


#define GPIOI_GPIO_OSPEEDR_OSPEED9_SHIFT		18
#define GPIOI_GPIO_OSPEEDR_OSPEED9_MASK		0x03
/** @defgroup gpioi_gpio_ospeedr_ospeed9 OSPEED9 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O output speed. Note: Refer to the device datasheet for the frequency specifications and the power supply and load conditions for each speed.
@{*/
/**@}*/


