grevaillot/svd_tools/headers/STM32H7x7_CM7/gpioi.h
#define GPIOI_GPIO_AFRH_AFSEL15_SHIFT		28
#define GPIOI_GPIO_AFRH_AFSEL15_MASK		0x0f
/** @defgroup gpioi_gpio_afrh_afsel15 AFSEL15 [3:0]: Alternate function selection for port x pin y (y = 8..15) These bits are written by software to configure alternate function I/Os
@{*/
/**@}*/


#define GPIOI_GPIO_AFRH_AFSEL14_SHIFT		24
#define GPIOI_GPIO_AFRH_AFSEL14_MASK		0x0f
/** @defgroup gpioi_gpio_afrh_afsel14 AFSEL14 [3:0]: Alternate function selection for port x pin y (y = 8..15) These bits are written by software to configure alternate function I/Os
@{*/
/**@}*/


#define GPIOI_GPIO_AFRH_AFSEL13_SHIFT		20
#define GPIOI_GPIO_AFRH_AFSEL13_MASK		0x0f
/** @defgroup gpioi_gpio_afrh_afsel13 AFSEL13 [3:0]: Alternate function selection for port x pin y (y = 8..15) These bits are written by software to configure alternate function I/Os
@{*/
/**@}*/


#define GPIOI_GPIO_AFRH_AFSEL12_SHIFT		16
#define GPIOI_GPIO_AFRH_AFSEL12_MASK		0x0f
/** @defgroup gpioi_gpio_afrh_afsel12 AFSEL12 [3:0]: Alternate function selection for port x pin y (y = 8..15) These bits are written by software to configure alternate function I/Os
@{*/
/**@}*/


#define GPIOI_GPIO_AFRH_AFSEL11_SHIFT		12
#define GPIOI_GPIO_AFRH_AFSEL11_MASK		0x0f
/** @defgroup gpioi_gpio_afrh_afsel11 AFSEL11 [3:0]: Alternate function selection for port x pin y (y = 8..15) These bits are written by software to configure alternate function I/Os
@{*/
/**@}*/


#define GPIOI_GPIO_AFRH_AFSEL10_SHIFT		8
#define GPIOI_GPIO_AFRH_AFSEL10_MASK		0x0f
/** @defgroup gpioi_gpio_afrh_afsel10 AFSEL10 [3:0]: Alternate function selection for port x pin y (y = 8..15) These bits are written by software to configure alternate function I/Os
@{*/
/**@}*/


#define GPIOI_GPIO_AFRH_AFSEL9_SHIFT		4
#define GPIOI_GPIO_AFRH_AFSEL9_MASK		0x0f
/** @defgroup gpioi_gpio_afrh_afsel9 AFSEL9 [3:0]: Alternate function selection for port x pin y (y = 8..15) These bits are written by software to configure alternate function I/Os
@{*/
/**@}*/


#define GPIOI_GPIO_AFRH_AFSEL8_SHIFT		0
#define GPIOI_GPIO_AFRH_AFSEL8_MASK		0x0f
/** @defgroup gpioi_gpio_afrh_afsel8 AFSEL8 [3:0]: Alternate function selection for port x pin y (y = 8..15) These bits are written by software to configure alternate function I/Os
@{*/
/**@}*/


/**@}*/
